{
  "format": "layers-model",
  "generatedBy": "keras v2.12.0",
  "convertedBy": "TensorFlow.js Converter v4.5.0",
  "modelTopology": {
    "keras_version": "2.12.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_3",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                150,
                150,
                3
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "conv2d_12_input"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_12",
              "trainable": true,
              "dtype": "float32",
              "batch_input_shape": [
                null,
                150,
                150,
                3
              ],
              "filters": 16,
              "kernel_size": [
                5,
                5
              ],
              "strides": [
                1,
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": {
                  "l2": 0.0010000000474974513
                }
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_3",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_13",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": {
                  "l2": 0.0010000000474974513
                }
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_4",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_14",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": {
                  "l2": 0.0010000000474974513
                }
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_5",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_15",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": {
                  "l2": 0.0010000000474974513
                }
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "AveragePooling2D",
            "config": {
              "name": "average_pooling2d_9",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten_3",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_6",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.1,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_6",
              "trainable": true,
              "dtype": "float32",
              "units": 512,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": {
                  "l2": 0.0010000000474974513
                }
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_7",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.1,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_7",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "binary_crossentropy",
      "metrics": [
        [
          {
            "class_name": "TruePositives",
            "config": {
              "name": "tp",
              "dtype": "float32",
              "thresholds": null
            }
          },
          {
            "class_name": "FalsePositives",
            "config": {
              "name": "fp",
              "dtype": "float32",
              "thresholds": null
            }
          },
          {
            "class_name": "TrueNegatives",
            "config": {
              "name": "tn",
              "dtype": "float32",
              "thresholds": null
            }
          },
          {
            "class_name": "FalseNegatives",
            "config": {
              "name": "fn",
              "dtype": "float32",
              "thresholds": null
            }
          },
          {
            "class_name": "BinaryAccuracy",
            "config": {
              "name": "accuracy",
              "dtype": "float32",
              "threshold": 0.5
            }
          },
          {
            "class_name": "Precision",
            "config": {
              "name": "precision",
              "dtype": "float32",
              "thresholds": null,
              "top_k": null,
              "class_id": null
            }
          },
          {
            "class_name": "Recall",
            "config": {
              "name": "recall",
              "dtype": "float32",
              "thresholds": null,
              "top_k": null,
              "class_id": null
            }
          },
          {
            "class_name": "AUC",
            "config": {
              "name": "auc",
              "dtype": "float32",
              "num_thresholds": 200,
              "curve": "ROC",
              "summation_method": "interpolation",
              "multi_label": false,
              "num_labels": null,
              "label_weights": null,
              "from_logits": false
            }
          },
          {
            "class_name": "SpecificityAtSensitivity",
            "config": {
              "name": "sensitivity",
              "dtype": "float32",
              "class_id": null,
              "num_thresholds": 200,
              "sensitivity": 0.8
            }
          }
        ]
      ],
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Custom>Adam",
        "config": {
          "name": "Adam",
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "jit_compile": true,
          "is_legacy_optimizer": false,
          "learning_rate": 0.0010000000474974513,
          "beta_1": 0.92,
          "beta_2": 0.999,
          "epsilon": 1e-7,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of4.bin",
        "group1-shard2of4.bin",
        "group1-shard3of4.bin",
        "group1-shard4of4.bin"
      ],
      "weights": [
        {
          "name": "conv2d_12/kernel",
          "shape": [
            5,
            5,
            3,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_12/bias",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_13/kernel",
          "shape": [
            3,
            3,
            16,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_13/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_14/kernel",
          "shape": [
            3,
            3,
            32,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_14/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_15/kernel",
          "shape": [
            3,
            3,
            64,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_15/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_6/kernel",
          "shape": [
            6272,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_6/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_7/kernel",
          "shape": [
            512,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_7/bias",
          "shape": [
            1
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}
